	


 
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~



 
¡
¢
£
¤
¥
¦
§
¨
©
ª
«
¬
­
®
¯
°
±
²
³
´
µ
¶
·
¸
¹
º
»
¼
½
¾
¿
À
Á
Â
Ã
Ä
Å
Æ
Ç
È
É
Ê
Ë
Ì
Í
Î
Ï
Ð
Ñ
Ò
Ó
Ô
Õ
Ö
×
Ø
Ù
Ú
Û
Ü
Ý
Þ
ß
à
á
â
ã
ä
å
æ
ç
è
é
ê
ë
ì
í
î
ï
ð
ñ
ò
ó
ô
õ
ö
÷
ø
ù
ú
û
ü
ý
þ
ÿ
Ā
ā
Ă
ă
Ą
ą
Ć
ć
Ĉ
ĉ
Ċ
ċ
Č
č
Ď
ď
Đ
đ
Ē
ē
Ĕ
ĕ
Ė
ė
Ę
ę
Ě
ě
Ĝ
ĝ
Ğ
ğ
Ġ
ġ
Ģ
ģ
Ĥ
ĥ
Ħ
ħ
Ĩ
ĩ
Ī
ī
ĭ
Į
į
İ
ı
Ĳ
ĳ
Ĵ
ĵ
Ķ
ķ
ĸ
Ĺ
ĺ
Ļ
ļ
Ľ
ľ
ŀ
Ł
ł
Ń
ń
Ņ
ņ
Ň
ň
ŉ
Ŋ
ŋ
Ō
ō
ŏ
Ő
ő
Œ
œ
Ŕ
ŕ
Ŗ
ŗ
Ř
ř
Ś
ś
Ŝ
ŝ
Ş
ş
Š
š
Ţ
ţ
Ť
ť
Ŧ
ŧ
Ũ
ũ
Ū
ū
Ŭ
ŭ
Ů
ů
Ű
ű
Ų
ų
Ŵ
ŵ
Ŷ
ŷ
Ÿ
Ź
ź
Ż
ż
Ž
ž
ſ
ƀ
Ɓ
Ƃ
Ɔ
Ƈ
ƈ
Ɖ
Ɗ
Ƌ
ƍ
Ǝ
Ə
Ɛ
Ƒ
ƒ
Ɠ
Ɣ
ƕ
ƙ
ƛ
Ɯ
Ɲ
ƞ
Ɵ
ơ
ƥ
Ʃ
ƪ
ƫ
ƭ
Ʈ
ư
Ʊ
Ʋ
ƴ
Ʒ
ƺ
ƻ
ƾ
ǀ
ǁ
ǂ
ǃ
ǎ
ǐ
ǒ
Ǔ
ǔ
ǜ
ǝ
ǣ
ǥ
Ǧ
ǧ
ǫ
ǯ
ǰ
ǹ
ȅ
ȑ
ȗ
Ș
ș
Ț
ț
ȡ
ȵ
ȶ
ɐ
ɑ
ɒ
ɓ
ɔ
ɕ
ɖ
ɗ
ɘ
ə
ɚ
ɛ
ɜ
ɝ
ɞ
ɟ
ɠ
ɡ
ɢ
ɣ
ɤ
ɥ
ɦ
ɧ
ɨ
ɩ
ɪ
ɫ
ɬ
ɭ
ɮ
ɯ
ɰ
ɱ
ɲ
ɳ
ɴ
ɵ
ɶ
ɷ
ɸ
ɹ
ɺ
ɻ
ɼ
ɽ
ɾ
ɿ
ʀ
ʁ
ʂ
ʃ
ʄ
ʅ
ʆ
ʇ
ʈ
ʉ
ʊ
ʋ
ʌ
ʍ
ʎ
ʏ
ʐ
ʑ
ʒ
ʓ
ʔ
ʕ
ʖ
ʗ
ʘ
ʙ
ʚ
ʛ
ʜ
ʝ
ʞ
ʟ
ʠ
ʡ
ʢ
ʣ
ʤ
ʥ
ʦ
ʧ
ʨ
ʩ
ʪ
ʫ
ʬ
ʭ
ʮ
ʯ
ʰ
ʱ
ʲ
ʶ
ʷ
ʹ
ʻ
ʼ
ʽ
ʾ
ʿ
ˀ
ˁ
ˆ
ˇ
ˈ
ˌ
ː
ˑ
˔
˕
˘
˙
˚
˛
˝
˞
ˠ
ˡ
ˢ
ˣ
ˤ
˥
˦
˧
˨
˩
̀
́
̂
̃
̄
̅
̆
̈
̊
̋
̌
̍
̕
̖
̗
̘
̙
̚
̛
̜
̝
̞
̟
̠
̡
̢
̣
̤
̥
̧
̩
̪
̫
̬
̮
̯
̰
̱
̴
̶
̸
̹
̺
̻
̼
̽
͂
͆
͇
͈
͉
͊
͋
͌
͍
͎
͡
͢
ͺ
΄
΅
Ά
Έ
Ή
Ί
Ό
Ύ
Ώ
ΐ
Α
Β
Γ
Δ
Ε
Ζ
Η
Θ
Ι
Κ
Λ
Μ
Ν
Ξ
Ο
Π
Ρ
Σ
Τ
Υ
Φ
Χ
Ψ
Ω
Ϊ
Ϋ
ά
έ
ή
ί
ΰ
α
β
γ
δ
ε
ζ
η
θ
ι
κ
λ
μ
ν
ξ
ο
π
ρ
ς
σ
τ
υ
φ
χ
ψ
ω
ϊ
ϋ
ό
ύ
ώ
Ϝ
Ϻ
Ѐ
Ё
Ђ
Ѓ
Є
Ѕ
І
Ї
Ј
Љ
Њ
Ћ
Ќ
Ѝ
Ў
Џ
А
Б
В
Г
Д
Е
Ж
З
И
Й
К
Л
М
Н
О
П
Р
С
Т
У
Ф
Х
Ц
Ч
Ш
Щ
Ъ
Ы
Ь
Э
Ю
Я
а
б
в
г
д
е
ж
з
и
й
к
л
м
н
о
п
р
с
т
у
ф
х
ц
ч
ш
щ
ъ
ы
ь
э
ю
я
ѐ
ё
ђ
ѓ
є
ѕ
і
ї
ј
љ
њ
ћ
ќ
ѝ
ў
џ
Ѡ
ѡ
Ѣ
ѣ
Ѥ
ѥ
Ѧ
ѧ
Ѩ
ѩ
Ѫ
ѫ
Ѭ
ѭ
Ѯ
ѯ
Ѱ
ѱ
Ѳ
ѳ
Ѵ
ѵ
Ѷ
ѷ
Ѹ
ѹ
Ѻ
ѻ
Ѽ
ѽ
Ѿ
ѿ
Ҁ
ҁ
҂
҃
҄
҅
҆
҇
҈
҉
Ҋ
ҋ
Ҍ
ҍ
Ҏ
ҏ
Ґ
ґ
Ғ
ғ
Ҕ
ҕ
Җ
җ
Ҙ
ҙ
Қ
қ
Ҝ
ҝ
Ҟ
ҟ
Ҡ
ҡ
Ң
ң
Ҥ
ҥ
Ҧ
ҧ
Ҩ
ҩ
Ҫ
ҫ
Ҭ
ҭ
Ү
ү
Ұ
ұ
Ҳ
ҳ
Ҵ
ҵ
Ҷ
ҷ
Ҹ
ҹ
Һ
һ
Ҽ
ҽ
Ҿ
ҿ
Ӏ
Ӂ
ӂ
Ӄ
ӄ
Ӆ
ӆ
Ӈ
ӈ
Ӊ
ӊ
Ӌ
ӌ
Ӎ
ӎ
ӏ
Ӑ
ӑ
Ӓ
ӓ
Ӕ
ӕ
Ӗ
ӗ
Ә
ә
Ӛ
ӛ
Ӝ
ӝ
Ӟ
ӟ
Ӡ
ӡ
Ӣ
ӣ
Ӥ
ӥ
Ӧ
ӧ
Ө
ө
Ӫ
ӫ
Ӭ
ӭ
Ӯ
ӯ
Ӱ
ӱ
Ӳ
ӳ
Ӵ
ӵ
Ӷ
ӷ
Ӹ
ӹ
Ӻ
ӻ
Ӽ
ӽ
Ӿ
ӿ
Ԁ
ԁ
Ԃ
ԃ
Ԅ
ԅ
Ԇ
ԇ
Ԉ
ԉ
Ԋ
ԋ
Ԍ
ԍ
Ԏ
ԏ
Ԑ
ԑ
Ԓ
ԓ
Ԕ
ԕ
Ԗ
ԗ
Ԙ
ԙ
Ԛ
ԛ
Ԝ
ԝ
Ԟ
ԟ
Ԡ
ԡ
Ԣ
ԣ
Ԥ
ԥ
Ԧ
ԧ
Ԩ
ԩ
Ԫ
ԫ
Ԭ
ԭ
Ԯ
ԯ
Ա
Բ
Գ
Դ
Ե
Զ
Է
Ը
Թ
Ժ
Ի
Լ
Խ
Ծ
Կ
Հ
Ձ
Ղ
Ճ
Մ
Յ
Ն
Շ
Ո
Չ
Պ
Ջ
Ռ
Ս
Վ
Տ
Ր
Ց
Ւ
Փ
Ք
Օ
Ֆ
ՙ
՚
՛
՜
՝
՞
՟
ա
բ
գ
դ
ե
զ
է
ը
թ
ժ
ի
լ
խ
ծ
կ
հ
ձ
ղ
ճ
մ
յ
ն
շ
ո
չ
պ
ջ
ռ
ս
վ
տ
ր
ց
ւ
փ
ք
օ
ֆ
և
։
֊
֐
֑
֒
֓
֔
֕
֖
֗
֘
֙
֚
֛
֜
֝
֞
֟
֠
֡
֢
֣
֤
֥
֦
֧
֨
֩
֪
֫
֬
֭
֮
֯
ְ
ֱ
ֲ
ֳ
ִ
ֵ
ֶ
ַ
ָ
ֹ
ֺ
ֻ
ּ
ֽ
־
ֿ
׀
ׁ
ׂ
׃
ׄ
ׅ
׆
ׇ
׈
׉
׊
׋
׌
׍
׎
׏
א
ב
ג
ד
ה
ו
ז
ח
ט
י
ך
כ
ל
ם
מ
ן
נ
ס
ע
ף
פ
ץ
צ
ק
ר
ש
ת
׫
׬
׭
׮
ׯ
װ
ױ
ײ
׳
״
׵
׶
׷
׸
׹
׺
׻
׼
׽
׾
׿
،
؛
؟
ء
آ
أ
ؤ
إ
ئ
ا
ب
ة
ت
ث
ج
ح
خ
د
ذ
ر
ز
س
ش
ص
ض
ط
ظ
ع
غ
ـ
ف
ق
ك
ل
م
ن
ه
و
ى
ي
ً
ٌ
ٍ
َ
ُ
ِ
ّ
ْ
٠
١
٢
٣
٤
٥
٦
٧
٨
٩
ٹ
پ
چ
ڈ
ډ
ژ
ک
گ
ں
ھ
ہ
ی
ې
ے
۰
۱
۲
۳
۴
۵
۶
۷
۸
۹
ܐ
ܘ
ܝ
ܡ
ܦ
ܪ
ܬ
ހ
ނ
ދ
ތ
ސ
ާ
ި
ީ
ު
ް
ँ
ं
ः
ऄ
अ
आ
इ
ई
उ
ऊ
ऋ
ऌ
ऍ
ऎ
ए
ऐ
ऑ
ऒ
ओ
औ
क
ख
ग
घ
ङ
च
छ
ज
झ
ञ
ट
ठ
ड
ढ
ण
त
थ
द
ध
न
ऩ
प
फ
ब
भ
म
य
र
ऱ
ल
ळ
ऴ
व
श
ष
स
ह
़
ऽ
ा
ि
ी
ु
ू
ृ
ॄ
ॅ
ॆ
े
ै
ॉ
ॊ
ो
ौ
्
ॐ
॑
॒
॓
॔
ॠ
ॡ
ॢ
ॣ
।
॥
०
१
२
३
४
५
६
७
८
९
॰
ঁ
ং
অ
আ
ই
ঈ
উ
এ
ও
ক
খ
গ
ঘ
ঙ
চ
ছ
জ
ঝ
ঞ
ট
ঠ
ড
ঢ
ণ
ত
থ
দ
ধ
ন
প
ফ
ব
ভ
ম
য
র
ল
শ
ষ
স
হ
়
া
ি
ী
ু
ূ
ৃ
ে
ৈ
ো
ৌ
্
০
১
২
৩
৪
৫
৬
৭
৮
৯
ਆ
ਇ
ਖ
ਗ
ਜ
ਟ
ਣ
ਤ
ਨ
ਭ
ਮ
ਰ
ਵ
ਸ
ਾ
ਿ
ੀ
ੁ
ੈ
ੜ
੦
੧
੨
੩
੪
੫
੬
੭
੮
੯
ੰ
ઁ
ં
અ
આ
ઇ
ઈ
ઉ
ઍ
એ
ક
ગ
ઘ
ચ
જ
ટ
ડ
ણ
ત
થ
દ
ધ
ન
પ
ફ
બ
ભ
મ
ય
ર
લ
ળ
વ
શ
ષ
સ
હ
ા
િ
ી
ુ
ૂ
ૃ
ૅ
ે
ો
્
૦
૧
૨
૩
૪
૫
૬
૭
૮
૯
ତ
ଭ
ର
ା
୦
୧
୨
୩
୪
୫
୬
୭
୮
୯
ஃ
அ
ஆ
இ
ஈ
உ
ஊ
எ
ஏ
ஐ
ஒ
ஓ
க
ங
ச
ஜ
ஞ
ட
ண
த
ந
ன
ப
ம
ய
ர
ற
ல
ள
ழ
வ
ஷ
ஸ
ஹ
ா
ி
ீ
ு
ூ
ெ
ே
ை
ொ
ோ
ௌ
்
௦
௧
௨
௩
௪
௫
௬
௭
௮
௯
ం
ఆ
ఇ
ఏ
క
గ
చ
ట
డ
త
ద
ధ
న
ప
ఫ
బ
భ
మ
య
ర
ల
ళ
వ
శ
ష
స
హ
ా
ి
ీ
ు
ూ
ె
ే
ో
్
ಂ
ಅ
ಆ
ಇ
ಎ
ಐ
ಕ
ಖ
ಗ
ಚ
ಜ
ಟ
ಡ
ಣ
ತ
ಥ
ದ
ಧ
ನ
ಪ
ಫ
ಬ
ಭ
ಮ
ಯ
ರ
ಲ
ಳ
ವ
ಶ
ಷ
ಸ
ಾ
ಿ
ೀ
ು
ೂ
ೆ
ೇ
ೊ
ೋ
್
೦
೧
೨
೩
೪
೫
೬
೭
೮
೯
ം
അ
ആ
ഇ
ഉ
ക
ഗ
ച
ജ
ട
ഡ
ണ
ത
ഥ
ദ
ന
പ
ഫ
ബ
മ
യ
ര
റ
ല
ള
വ
ശ
ഷ
സ
ഹ
ാ
ി
ീ
ു
െ
േ
ൈ
ോ
്
൦
൧
൨
൩
൪
൫
൬
൭
൮
൯
ඣ
න
ා
ก
ข
ฃ
ค
ฅ
ฆ
ง
จ
ฉ
ช
ซ
ฌ
ญ
ฎ
ฏ
ฐ
ฑ
ฒ
ณ
ด
ต
ถ
ท
ธ
น
บ
ป
ผ
ฝ
พ
ฟ
ภ
ม
ย
ร
ฤ
ล
ฦ
ว
ศ
ษ
ส
ห
ฬ
อ
ฮ
ฯ
ะ
ั
า
ำ
ิ
ี
ึ
ื
ุ
ู
ฺ
฿
เ
แ
โ
ใ
ไ
ๅ
ๆ
็
่
้
๊
๋
์
ํ
๎
๏
๐
๑
๒
๓
๔
๕
๖
๗
๘
๙
๚
๛
ກ
ຄ
ຍ
ດ
ຕ
ຖ
ນ
ປ
ພ
ມ
ຢ
ລ
ວ
ສ
ອ
ຯ
ະ
ັ
າ
ິ
ີ
ຸ
ເ
ແ
ໂ
່
་
༠
༡
༢
༣
༤
༥
༦
༧
༨
༩
ཀ
ག
ང
ཆ
ཉ
ད
བ
མ
ཞ
འ
ར
ཥ
ི
ུ
ོ
ྟ
ྱ
ྲ
ླ
က
စ
တ
ထ
န
ပ
ရ
လ
ဝ
ဟ
အ
ာ
ိ
ီ
ု
ူ
း
္
ა
ბ
გ
დ
ე
ვ
ზ
თ
ი
კ
ლ
მ
ნ
ო
პ
ჟ
რ
ს
ტ
უ
ფ
ქ
ღ
ყ
შ
ჩ
ც
ძ
წ
ჭ
ხ
ჯ
ჰ
ᄋ
ᄼ
ᄽ
ᄾ
ᄿ
ᅎ
ᅏ
ᅐ
ᅑ
ᅔ
ᅕ
ᆩ
ᆻ
ᆼ
ᇢ
ᇦ
ᇰ
ᇴ
ሀ
ሁ
ሂ
ሃ
ህ
ለ
ሊ
ላ
ል
ሕ
መ
ማ
ሜ
ም
ረ
ሩ
ሪ
ራ
ሬ
ር
ሰ
ስ
ሶ
ሽ
ቃ
ቅ
ቡ
ቢ
ብ
ቦ
ቨ
ተ
ት
ቶ
ቻ
ኅ
ና
ን
ኛ
አ
ኤ
እ
ከ
ኪ
ካ
ኬ
ክ
ዋ
ው
ዓ
ዚ
ዝ
የ
ያ
ይ
ደ
ዳ
ዴ
ድ
ጀ
ጄ
ጅ
ጆ
ገ
ጊ
ጋ
ግ
ጎ
ጽ
ፅ
ፋ
ፍ
ፑ
ፔ
ፕ
Ꭰ
Ꭱ
Ꭲ
Ꭴ
Ꭶ
Ꭹ
Ꮃ
Ꮆ
Ꮇ
Ꮈ
Ꮎ
Ꮑ
Ꮒ
Ꮕ
Ꮖ
Ꮗ
Ꮙ
Ꮜ
Ꮝ
Ꮢ
Ꮧ
Ꮪ
Ꮳ
Ꮵ
Ꮷ
Ꮺ
Ꮿ
Ᏻ
ᐃ
ᐅ
ᐆ
ᐊ
ᐱ
ᐳ
ᐸ
ᑎ
ᑐ
ᑕ
ᑦ
ᑭ
ᑯ
ᑲ
ᒃ
ᒋ
ᒥ
ᒪ
ᓂ
ᓇ
ᓈ
ᓐ
ᓕ
ᓗ
ᓛ
ᓪ
ᓯ
ᓰ
ᓱ
ᓴ
ᔅ
ᔪ
ᔭ
ᕆ
ᕈ
ᕋ
ᕐ
ᕖ
ᖃ
ᖅ
ᚼ
ᛒ
ក
ខ
គ
ង
ច
ឆ
ជ
ញ
ដ
ឋ
ឌ
ណ
ត
ថ
ទ
ន
ប
ភ
ម
យ
រ
ល
វ
ស
ហ
អ
ឥ
ា
ិ
ី
ឹ
ុ
ូ
ួ
ើ
េ
ែ
ៃ
ោ
ៅ
ំ
៉
់
៎
្
᠁
ᵊ
Ḃ
ḃ
ḇ
Ḋ
ḋ
ḍ
Ḏ
ḏ
ḛ
Ḟ
ḟ
ḡ
Ḥ
ḥ
Ḩ
ḫ
Ḳ
ḳ
ḵ
ḷ
ḹ
Ṁ
ṁ
ṃ
ṅ
ṇ
Ṉ
Ṗ
ṗ
Ṛ
ṛ
ṝ
Ṡ
ṡ
Ṣ
ṣ
Ṫ
ṫ
Ṭ
ṭ
ṯ
Ẁ
ẁ
Ẃ
ẃ
Ẅ
ẅ
Ẓ
ẓ
ẗ
ạ
Ả
ả
Ấ
ấ
ầ
ẩ
ẫ
ậ
ắ
ằ
ẳ
ặ
ẹ
ẻ
ẽ
ế
ề
ể
ễ
ệ
ỉ
ị
ọ
ỏ
ố
ồ
Ổ
ổ
ỗ
ộ
ớ
ờ
ở
ỡ
ợ
ụ
ủ
ứ
ừ
ử
ữ
ự
Ỳ
ỳ
ỹ
ἀ
ἁ
ἂ
ἃ
ἄ
ἅ
Ἀ
Ἁ
Ἂ
Ἄ
Ἅ
ἐ
ἑ
ἔ
ἕ
Ἐ
Ἑ
Ἕ
ἠ
ἡ
ἣ
ἥ
ἦ
Ἠ
Ἡ
ἰ
ἱ
ἳ
ἴ
ἵ
ἶ
Ἰ
Ἱ
ὀ
ὁ
ὃ
ὄ
ὅ
Ὀ
Ὁ
ὐ
ὑ
ὔ
ὕ
ὖ
ὠ
ὡ
ὥ
Ὤ
ὰ
ὲ
ὴ
ὶ
ὸ
ὺ
ᾍ
ᾰ
ᾱ
ᾶ
ᾷ
ῃ
ῆ
ῐ
ῒ
ῖ
ῤ
ῥ
ῦ
Ῥ
ῳ
ῶ
῾
​
‌
‍
‎
‏
‐
‑
–
—
―
‖
‗
‘
’
‚
‛
“
”
„
†
‡
•
…
 
‬
‮
′
″
‹
›
‼
‿
⁄
⁷
⁼
ⁿ
₁
₍
₎
₠
₧
₪
€
₯
ℂ
℃
ℎ
ℏ
™
ℭ
℮
ℵ
Ⅰ
Ⅲ
Ⅽ
Ⅾ
ⅰ
ⅽ
ⅾ
←
↑
→
↓
↔
↕
↗
↘
↨
↵
⇌
⇒
∀
∂
∃
∅
∆
∈
∑
−
∙
√
∞
∟
∧
∨
∩
∪
∫
∴
≅
≈
≠
≡
≤
≥
⊆
⊇
⊦
⋮
⋯
⋰
⋱
⌂
⌐
⌠
⌡
⍋
─
━
│
┌
┐
└
┘
├
┤
┬
┴
┼
═
║
╒
╓
╔
╕
╖
╗
╘
╙
╚
╛
╜
╝
╞
╟
╠
╡
╢
╣
╤
╥
╦
╧
╨
╩
╪
╫
╬
╭
╮
▀
▄
█
▌
▐
░
▒
▓
■
▬
▲
►
▼
▽
◄
◊
○
●
◘
◙
☄
☆
☧
☺
☻
☼
♀
♂
♈
♊
♑
♒
♠
♣
♥
♦
♪
♫
♭
♯
　
、
。
〇
〈
〉
《
》
「
」
〡
〢
〣
〤
〥
〦
〧
〨
〩
ぁ
あ
ぃ
い
う
ぇ
え
お
か
が
き
ぎ
く
ぐ
け
げ
こ
ご
さ
ざ
し
じ
す
ず
せ
ぜ
そ
ぞ
た
だ
ち
ぢ
っ
つ
づ
て
で
と
ど
な
に
ぬ
ね
の
は
ば
ぱ
ひ
び
ぴ
ふ
ぶ
ぷ
へ
べ
ぺ
ほ
ぼ
ぽ
ま
み
む
め
も
ゃ
や
ゅ
ゆ
ょ
よ
ら
り
る
れ
ろ
わ
ゐ
ゑ
を
ん
ゔ
゛
゜
ゝ
ァ
ア
ィ
イ
ゥ
ウ
ェ
エ
ォ
オ
カ
ガ
キ
ギ
ク
グ
ケ
ゲ
コ
ゴ
サ
ザ
シ
ジ
ス
ズ
セ
ゼ
ソ
ゾ
タ
ダ
チ
ッ
ツ
テ
デ
ト
ド
ナ
ニ
ヌ
ネ
ノ
ハ
バ
パ
ヒ
ビ
ピ
フ
ブ
プ
ヘ
ベ
ペ
ホ
ボ
ポ
マ
ミ
ム
メ
モ
ャ
ヤ
ュ
ユ
ョ
ヨ
ラ
リ
ル
レ
ロ
ワ
ン
ヴ
・
ー
ㄍ
ㄓ
ㄡ
ㄤ
ㄨ
ㄱ
ㄲ
ㄳ
ㄴ
ㄵ
ㄶ
ㄷ
ㄸ
ㄹ
ㄺ
ㄻ
ㄼ
ㄽ
ㄾ
ㄿ
ㅀ
ㅁ
ㅂ
ㅃ
ㅄ
ㅅ
ㅆ
ㅇ
ㅈ
ㅉ
ㅊ
ㅋ
ㅌ
ㅍ
ㅎ
ㅏ
ㅐ
ㅑ
ㅒ
ㅓ
ㅔ
ㅕ
ㅖ
ㅗ
ㅘ
ㅙ
ㅚ
ㅛ
ㅜ
ㅝ
ㅞ
ㅟ
ㅠ
ㅡ
ㅢ
ㅣ
ㅥ
ㅦ
ㅧ
ㅨ
ㅩ
ㅪ
ㅫ
ㅬ
ㅭ
ㅮ
ㅯ
ㅰ
ㅱ
ㅲ
ㅳ
ㅴ
ㅵ
ㅶ
ㅷ
ㅸ
ㅹ
ㅺ
ㅻ
ㅼ
ㅽ
ㅾ
ㅿ
ㆀ
ㆁ
ㆂ
ㆃ
ㆄ
ㆅ
ㆆ
ㆇ
ㆈ
ㆉ
ㆊ
ㆋ
ㆌ
ㆍ
ㆎ
䓬
一
丁
七
万
三
上
下
不
与
丑
专
且
丕
世
丘
丙
业
东
丝
丟
両
两
严
並
个
中
丰
串
丶
丸
丹
为
主
丽
乃
久
么
义
之
乌
乍
乐
乒
乓
乔
乗
乘
乙
九
也
乡
书
乱
乳
乾
亂
了
予
争
事
二
云
互
五
井
亚
亜
亞
亡
交
亥
亦
产
亨
亩
享
京
亮
亲
人
什
仁
仅
今
介
仏
仑
仓
仔
仕
他
付
仙
仟
代
令
以
仮
仰
仲
件
价
任
份
企
伊
伍
伏
伐
休
会
伝
伞
传
伦
伪
伯
伴
伶
伽
但
佇
佈
位
低
住
佐
佑
体
何
余
佛
作
你
佩
佰
佳
使
來
依
侬
侯
便
係
俄
俊
保
俠
信
修
俱
俳
倉
個
倒
候
値
倫
倭
值
假
偕
停
健
側
偵
偶
偽
傅
傑
備
储
催
傳
傻
働
像
僕
僖
僚
儀
億
儒
優
儲
允
元
兄
充
兆
先
光
克
免
児
兒
兔
党
入
內
全
兩
八
公
六
兰
共
关
兴
兵
具
典
兹
兼
内
円
冊
册
再
冒
冕
写
军
农
冬
冯
冰
冲
况
冶
冷
准
凋
凍
减
凝
几
処
凧
凯
凱
凸
出
击
函
刀
分
切
刑
划
列
刘
刚
初
判
別
利
别
刮
到
制
刺
剂
則
前
剑
剖
剛
剣
剤
剧
剩
副
剰
割
創
劃
劇
劉
力
功
加
务
动
助
努
劫
劳
労
効
劾
势
勃
勇
勒
動
務
勞
勢
勤
勸
勾
勿
包
匈
化
北
匯
匹
区
医
匿
區
十
千
卄
卅
升
午
半
卌
华
协
卐
卑
卓
協
单
南
単
博
卜
占
卡
卢
卤
卦
卫
卯
印
危
却
卷
卻
厄
历
压
厕
厘
原
厥
厦
厳
去
县
叁
参
叄
又
叉
及
友
双
反
収
发
叔
取
变
叟
叠
叡
口
古
句
叨
只
叫
可
台
史
右
叶
号
司
吃
各
合
吉
同
名
后
向
吒
吗
君
吞
含
启
吳
吴
吹
吾
呀
呆
呉
告
呒
员
呢
呤
周
味
呼
命
咁
和
咖
咸
哀
品
哆
哈
响
哎
員
哥
哩
哪
哲
唇
唐
唔
唧
唯
唱
商
啊
問
啓
啟
啡
啤
啥
啦
啱
喀
善
喇
喉
喜
喬
單
喺
嗎
嗜
嗰
嘉
嘌
嘛
嘸
器
嚴
四
回
因
团
団
园
図
固
国
图
圆
圈
國
圍
圏
園
圓
圖
團
土
圣
圧
在
圭
地
场
址
坂
均
坎
坏
坐
坑
坚
坛
坞
坡
坦
垂
型
垓
垩
埃
城
埔
域
執
培
基
堂
堅
堆
堉
堕
堡
堤
堰
報
場
塁
塔
塗
塚
塞
塩
塵
境
墓
増
墜
墨
墩
墳
壁
壊
壘
士
壬
壮
声
壹
壺
夂
处
备
変
夊
复
夏
外
多
夜
夢
大
天
太
夫
央
失
头
夷
奇
奈
奏
契
奔
奖
套
奥
奧
奪
女
奴
奶
好
如
妈
妊
妥
妮
妻
姆
始
姓
委
姚
姦
姬
威
娃
娛
娜
娠
婆
婉
婚
婦
媒
媽
嬉
嬰
嬴
子
孔
孕
字
存
孙
孚
孛
孝
孟
季
孤
学
孫
學
宁
宇
守
安
宋
完
宗
官
宙
定
宜
宝
实
実
客
宣
室
宪
宫
宮
害
宴
家
容
宽
宾
宿
寅
密
富
寒
寓
寛
寝
察
寧
寨
審
寫
寶
寸
对
导
対
封
射
将
專
尉
尊
尋
對
小
少
尔
尤
尭
尼
尽
尾
尿
局
屁
层
屄
居
屋
展
属
屠
層
履
屬
山
屿
岐
岛
岩
岸
峡
峨
島
峻
峽
崇
崗
崩
嵯
嶋
川
州
巡
巢
工
巧
巫
差
己
已
巳
巴
巾
币
市
布
师
希
帕
帖
帜
帝
带
師
席
帮
帯
常
幅
幕
幣
干
平
年
幹
幺
幻
幼
幽
幾
广
広
庄
庆
庇
序
库
应
底
店
庙
庚
府
庞
度
座
庭
庶
康
庸
廁
廈
廉
廣
延
廷
建
廿
开
弁
异
弈
式
引
弗
弘
弟
张
弥
弦
弩
張
強
弹
强
弾
彈
彌
当
录
彗
形
彦
彩
彪
影
役
彻
彼
征
径
待
很
律
後
徒
得
御
復
循
微
徳
徴
德
徽
心
必
忒
志
応
忠
快
念
忽
怀
态
怖
思
急
性
怪
总
恆
恋
恐
恒
恩
恭
息
恰
恺
悖
患
悪
悯
情
惑
惟
惠
惡
惧
惯
想
意
愛
感
慈
態
慌
慕
慣
憲
憶
應
懶
懷
戀
戈
戊
戌
戏
成
我
战
戦
截
戰
戲
戴
戶
户
戸
房
所
扉
手
才
扎
扑
打
托
扩
扬
扮
扰
扶
承
技
抑
投
抗
折
抚
択
护
报
押
抽
拉
拓
拔
拖
拜
拟
拡
括
拳
拾
拿
持
指
挙
振
挿
捌
捜
换
捨
据
捷
捻
授
掌
排
探
接
控
推
掲
描
提
插
揚
換
搖
搜
搞
携
搿
摂
摄
摆
摩
撃
撒
撞
播
擊
操
擦
擬
攀
支
攵
收
攻
放
政
故
效
敏
教
散
敦
数
整
敷
數
文
斉
斋
斎
斐
斗
料
断
斯
新
斷
方
施
旅
旋
族
旗
无
既
日
旧
时
昂
昆
昌
明
易
星
映
春
昧
昭
是
昱
昴
显
時
晉
晋
晓
普
景
晰
晶
智
暑
暖
暗
暦
暨
暴
曆
曖
曜
曲
更
書
曼
替
最
會
月
有
朋
服
朗
望
朝
期
木
未
末
本
札
术
朱
机
杀
杂
权
杉
李
杏
村
杜
条
来
杨
杭
杯
杰
東
杼
松
板
极
构
析
林
果
枪
枯
柏
柒
染
柔
查
柬
柯
柱
査
栄
标
树
栖
校
株
核
根
格
栽
桂
桃
案
桑
桓
档
桥
桧
梁
梅
條
梨
梯
械
梵
棉
棋
棍
棒
棕
棣
森
植
椎
検
椭
楊
楕
業
楯
極
楷
楼
楽
概
榴
構
槍
様
槤
樂
標
模
樣
権
樹
橄
橋
橘
機
橫
橿
檀
檔
檢
權
欖
欠
次
欢
欧
欽
歇
歌
歐
止
正
步
武
歧
歩
歯
歳
歴
歷
歸
歹
死
殊
殖
段
殷
殺
殻
殼
殿
毀
母
毒
比
毕
毛
毫
氏
氐
民
气
気
氘
氟
氢
氣
氦
氧
氨
氩
氮
氯
氰
水
氷
永
汀
汇
汉
汏
汗
江
池
汤
汴
汶
決
汽
汾
沃
沈
沉
沌
沖
沙
沟
没
沢
沱
河
沸
油
治
泉
泊
泌
法
泛
泡
波
泰
泳
泽
洋
洗
洛
洞
津
洪
洲
活
派
流
浆
测
济
浓
浙
浩
浪
浮
海
浸
涅
消
涉
涎
液
涵
淀
淇
淝
深
淳
淵
混
添
清
済
渉
渐
減
温
測
港
游
渺
湖
湘
湾
満
源
準
溝
溫
溴
滅
滋
滑
滕
滤
滨
滷
滿
漁
演
漠
漢
漫
漿
潔
潟
澗
澤
澳
激
濁
濃
濟
瀉
瀕
瀬
灣
火
灭
灰
灵
灸
炉
炎
炒
炔
炙
炭
炮
炸
点
炼
烃
烈
烏
烤
烧
热
烯
烷
烹
烽
焓
無
焦
然
焼
煉
煤
熈
熊
熙
熱
熵
燃
燈
燒
燕
燭
爆
爭
爱
爵
父
爾
牆
片
版
牌
牙
牛
牧
物
牲
特
犠
犧
犬
犯
状
犹
狄
狐
独
狸
猜
猩
猫
猶
猿
獄
獅
獎
獏
獣
獨
率
玉
王
玖
玛
环
现
玻
珀
珊
珍
珠
珥
珪
班
現
球
理
琉
琛
琥
琴
瑙
瑚
瑞
瑟
瑤
瑪
璃
璋
環
瓜
瓦
瓶
甘
甙
甚
甜
生
產
産
用
田
由
甲
申
电
男
甸
町
画
界
留
畢
略
番
畫
異
畳
畴
當
疆
疗
疚
疣
疫
疾
病
症
痘
痧
痿
療
癌
癸
発
登
發
白
百
的
皆
皇
皮
盃
益
盎
盔
盖
盘
盛
盟
監
盤
盪
目
盲
直
相
省
県
真
眠
着
督
知
石
码
砂
研
砲
破
砷
砹
硬
硼
碑
碘
碧
碱
碳
確
碼
磁
磚
磨
磯
磷
示
礼
社
祈
祐
祖
祝
神
祭
祷
禁
福
禧
禮
禺
离
秀
私
秋
种
科
秦
秭
积
称
移
程
税
稚
種
稲
穀
穂
穌
積
穗
穰
穴
究
穷
空
突
窒
窟
竇
立
站
竜
竞
章
端
竹
笃
笑
笔
笛
笠
符
笨
第
筆
等
筋
筑
筒
筝
筷
简
算
管
箭
箱
箴
箸
節
篆
築
篮
簡
簧
籍
米
类
粉
粒
粤
粥
粮
粵
粹
粽
精
糖
糞
糧
糰
系
紀
約
紅
紋
納
純
紙
級
素
索
紧
累
細
終
組
経
結
絕
絞
統
絲
絶
綏
經
継
続
綠
綢
維
綱
綴
綿
総
緑
緒
線
締
緣
編
緯
縁
縄
縣
縮
縱
總
繁
繊
繍
織
繚
繪
纖
红
纤
约
级
纪
纬
纯
纳
纺
纽
线
组
细
织
终
经
结
络
绝
统
绣
继
绪
续
维
综
绿
缓
编
缩
缪
缺
罐
网
罕
罗
罪
置
罵
羅
羊
美
群
羧
義
羯
羽
翁
翅
翰
翼
老
考
者
而
耐
耕
耳
耶
耷
联
聖
聚
聞
聯
聰
聲
職
聽
聿
肃
肅
肆
肇
肉
肌
肖
肛
肝
股
肢
肥
肩
肪
肯
育
肾
背
胎
胖
胚
胞
胡
胰
胸
胺
能
脂
脇
脈
脊
脑
脱
脳
脷
腊
腎
腓
腦
腰
腳
腸
腺
膏
膜
膠
膽
臘
臣
臥
臨
自
臭
至
致
臺
與
興
舉
舌
舞
航
般
舰
舱
船
艦
艮
良
色
艺
艾
节
芒
芝
芦
芬
芭
花
芳
芸
苋
苏
苑
苗
若
苯
英
苴
苷
苹
苻
范
茅
茨
茲
茵
茶
草
荒
荟
荣
荧
药
荷
莉
莎
莫
莱
莽
菊
菌
菜
菩
華
菲
萄
萊
萎
营
萧
萨
萬
落
葉
著
葛
葡
葬
蒂
蒋
蒙
蒲
蒸
蓋
蓑
蓝
蓟
蓬
蓮
蔣
蔥
薄
薊
薛
薩
薫
薬
藁
藍
藏
藤
藥
藻
蘇
蘭
虎
處
虛
號
虫
蚁
蚂
蚓
蚟
蚯
蛇
蛋
蛍
蛙
蛛
蜂
蜒
蜘
蜜
蜡
蝌
蝙
蝠
蝦
蝴
蝶
融
蟄
蟲
蠕
血
衆
行
衍
術
衛
衡
衣
表
衰
袁
袍
被
裁
装
裏
裔
裕
裝
裡
裴
製
複
襪
襲
西
要
見
規
視
覚
覧
親
観
覺
觀
见
视
觉
角
解
触
觸
言
訇
計
訊
訓
託
記
訟
設
訴
訶
診
証
詔
評
詞
詩
話
該
詹
誉
誌
認
誕
語
誠
誤
說
説
読
調
請
論
諦
諧
諸
諺
諾
謀
謙
講
謝
謠
證
識
譚
譜
警
議
護
讀
變
计
认
让
议
记
讲
许
论
设
证
诃
识
词
译
话
诞
该
语
说
请
诺
调
谋
谍
谔
谛
谟
谢
谱
谷
豆
豊
豚
象
豢
豪
豬
豹
豺
貓
貝
貞
財
貨
貳
貴
費
貿
資
賛
賞
賢
質
賭
賽
贛
贝
负
贡
财
贤
质
贰
贵
贸
费
贼
资
赋
赌
赖
赛
赣
赤
赦
赫
走
赵
起
超
越
趣
足
跃
跌
路
跳
踏
蹄
蹈
蹦
身
車
軍
軟
転
軽
載
輭
輯
輸
輻
輾
轉
轟
车
轨
转
轮
软
轰
轴
辅
辐
辑
输
辖
辛
辞
辟
辣
辩
辭
辰
農
辺
込
辽
达
过
迈
运
近
这
进
远
连
迦
迪
述
迹
送
逆
选
逊
逐
這
通
速
造
連
進
逸
遊
運
過
道
達
遗
遠
遣
適
遷
選
遺
遼
避
邁
邊
邏
邑
邓
那
邦
邪
邮
邱
郁
郎
郑
郝
郡
部
都
鄭
酉
配
酒
酗
酥
酪
酵
酶
酸
醇
醗
醚
醫
醬
采
釈
里
重
野
量
釐
金
針
鉄
鉱
銀
銃
銅
銘
鋼
錐
錢
錨
錬
錯
録
鍛
鍼
鎚
鎮
鏡
鐘
鐵
鑑
钆
针
钙
钟
钡
钦
钫
钬
钴
钿
铁
铈
铋
铍
铒
铕
铜
铝
铟
铪
铬
铭
铯
铱
银
锋
锎
锑
锔
锕
锗
锚
锡
锤
锥
锫
键
锿
镄
镅
镇
镉
镓
镜
镝
長
长
門
閉
開
閑
間
関
閣
閩
閲
闘
關
门
闪
问
间
闻
闽
阉
阜
队
防
阳
阴
阿
陀
际
陆
降
限
陕
陛
陝
院
除
险
陰
陳
陵
陶
陷
陸
険
陽
隆
隈
隊
隋
階
随
隐
隔
際
障
隧
險
隷
隸
隼
雀
雄
雅
集
雌
雍
雑
雕
雞
離
難
雨
雪
雲
零
雷
電
震
霊
霍
霜
霰
露
霸
靈
青
靖
静
非
面
革
鞘
韃
韓
韦
音
韻
響
項
頓
領
頚
頡
頭
頻
頼
題
額
顔
顕
願
顛
類
顯
页
顺
顿
颈
颉
频
题
颜
颠
風
飄
风
飛
飞
食
飢
飯
飲
飼
飽
餅
養
餐
館
饅
饉
饑
饥
饪
饭
饮
饰
饺
饿
馆
馈
馏
馕
首
香
馬
駆
駐
騎
験
騰
驚
马
驱
驼
骂
骆
验
骑
骨
骰
骼
髄
體
高
髦
髭
髮
鬥
鬱
鬼
魁
魏
魔
魚
魯
鮑
鯨
鰓
鰭
鱼
鲁
鲍
鲜
鲸
鳥
鴉
鴻
鴿
鵝
鶏
鶯
鷦
鷯
鷹
鸟
鸠
鸡
鸭
鹃
鹳
鹿
麒
麟
麥
麦
麻
麼
黃
黄
黎
黏
黑
黒
默
黙
點
黨
鼓
鼠
鼻
齊
齋
齐
齒
齡
龍
龙
가
각
간
갈
감
갑
값
강
개
객
갠
갯
거
건
검
겁
것
겉
게
겐
겔
겠
겨
격
결
경
계
고
곡
곤
골
곰
곱
공
과
관
괄
괌
광
괴
교
구
국
군
굴
권
궐
귀
귈
균
귤
그
극
근
귿
글
금
급
기
긴
길
김
깨
께
끓
끼
나
낙
난
날
남
낭
낱
내
낸
냉
냐
냥
너
넌
널
넘
네
넬
넷
년
념
녕
노
녹
논
놀
놈
농
뇌
뇨
누
뉴
늄
느
는
능
니
닉
닝
다
단
달
담
당
닿
대
댕
더
덕
덜
덤
덩
데
덴
델
도
독
돈
돋
돌
돔
동
되
된
두
둘
둥
뒤
듐
드
들
등
디
딘
딩
딱
똥
라
락
란
랄
람
랍
랏
랑
래
랙
랜
램
랫
랭
량
러
런
럴
럼
럽
레
렉
렌
렐
려
력
련
렬
령
례
로
록
론
롤
롬
롭
뢰
료
룡
루
룩
룬
룰
룹
룻
뤼
류
륙
륨
르
른
를
름
리
릭
린
릴
림
립
릿
링
마
막
만
말
맘
맙
매
맥
맨
맹
머
먼
메
멕
멘
멜
멤
면
멸
명
모
목
몬
몰
몸
못
몽
무
묵
문
물
뮈
뮤
뮬
뮴
믈
미
민
밀
밍
및
바
박
반
받
발
밟
방
배
백
밴
밸
뱀
뱅
버
번
벌
법
베
벤
벨
벼
벽
변
별
병
보
복
본
볼
봄
봉
부
북
분
불
붕
븀
브
블
비
빅
빈
빌
빙
빠
뼈
사
삭
산
살
삼
상
새
색
생
샤
샨
서
석
선
설
섬
섭
섯
성
세
센
셀
셈
셔
션
셰
셸
소
속
손
송
쇼
수
순
술
숫
쉬
슈
슐
슘
스
슨
슬
습
승
시
식
신
실
심
십
싱
쌍
쓰
씨
아
악
안
알
암
압
앙
애
액
앤
앨
앵
야
약
양
얘
어
억
언
얼
엄
업
없
에
엑
엔
엘
엠
엥
여
역
연
열
염
엽
영
예
옐
옛
오
온
올
옷
옹
와
완
왕
왜
외
요
용
우
운
울
움
워
원
월
웨
웰
웹
위
윈
윗
유
육
율
으
윽
은
읃
을
음
읍
읏
응
읒
읓
읔
읕
읖
읗
의
이
익
인
일
임
입
잇
잉
자
작
잔
잠
장
재
잭
쟁
저
적
전
절
점
접
젓
정
제
젠
젤
조
족
존
종
좌
주
준
줄
중
쥐
즈
즘
증
지
직
진
질
집
징
째
쪽
쯔
차
찬
찰
창
채
처
척
천
철
첩
첫
청
체
첸
첼
초
촉
촘
총
추
축
출
춤
충
취
츠
층
치
칙
친
칠
침
칭
카
칵
칸
칼
캐
캔
캘
캣
커
컨
컬
컴
컵
컷
케
켄
켈
켓
코
콕
콘
콜
콧
콩
콰
쾰
쿠
쿡
쿨
퀴
퀼
크
큰
클
키
킨
킬
타
탄
탈
탕
태
택
탤
탱
터
턴
털
텀
테
텍
텐
텔
토
톤
톰
통
투
툴
툼
튜
트
튼
틀
티
틴
틸
팅
파
판
패
팩
팬
팰
팻
팽
퍼
펌
펑
페
펜
펠
편
평
폐
포
폭
폰
폴
표
푸
푼
풀
퓨
퓸
프
플
피
픽
핀
필
핑
하
학
한
할
함
합
항
해
핵
핸
햄
햇
행
향
허
헌
험
헝
헤
헥
헨
헬
헴
혁
현
혈
협
형
혜
호
혼
홀
홈
홍
화
확
환
활
황
회
획
효
후
훈
훔
휴
흄
흐
흑
희
히
힌
힐
힘
힙


ﷲ
ﺀ
ﺃ
ﺍ
ﺎ
ﺏ
ﺒ
ﺕ
ﺙ
ﺝ
ﺡ
ﺥ
ﺩ
ﺫ
ﺭ
ﺯ
ﺱ
ﺵ
ﺹ
ﺽ
ﻁ
ﻅ
ﻉ
ﻋ
ﻍ
ﻑ
ﻕ
ﻙ
ﻝ
ﻡ
ﻥ
ﻫ
ﻭ
ﻯ
ﻰ
ﻱ
ﻳ
ﻴ
﻿
！
＇
（
）
，
－
１
２
３
４
５
；
＝
？
Ｓ
Ｖ
Ｗ
｀
ｃ
ｈ
～
ｷ
ﾀ
ﾟ
￣
�
𐌰
𐌲
𐌳
𐌴
𐌶
𐌹
𐌺
𐌻
𐌽
𐌿
𐍂
𐍃
𐍄
𐍆
𨧀
𨨏
𨭆
